{"config": {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 63], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 63]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}], "build_input_shape": [null, 63]}, "registered_name": null, "build_config": {"input_shape": [null, 63]}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}, "weights": [[[[0.044842664152383804, -0.01090451329946518, -0.1735416203737259, 0.21669583022594452, 0.055145520716905594, 0.008652188815176487, 0.11168348044157028, 0.07882824540138245, -0.029620153829455376, 0.1977960616350174, 0.0388491116464138, -0.1469486653804779, 0.050112660974264145, 0.09980848431587219, -0.16913145780563354, 0.10747474431991577, -0.12928545475006104, -0.08123999834060669, -0.1441808044910431, -0.12239644676446915, 0.07832847535610199, -0.1688399761915207, -0.1193762943148613, -0.16042692959308624, 0.01575799286365509, -0.03148327022790909, -0.07254349440336227, -0.06639911234378815, -0.09342743456363678, 0.046943675726652145, -0.02949179895222187, 0.11628100275993347, -0.09144684672355652, 0.13297688961029053, 0.16274258494377136, 0.09886781871318817, 0.16959251463413239, 0.10141006857156754, 0.02088765799999237, 0.09687001258134842, -0.0757942870259285, -0.020972922444343567, -0.00600786367431283, 0.16380643844604492, -0.0475807748734951, 0.007459541317075491, -0.004401652608066797, -0.05294390767812729, -0.1781664788722992, -0.13314753770828247, 0.09405982494354248, -0.010420811362564564, -0.051707543432712555, 0.06509557366371155, -0.045698560774326324, -0.08723584562540054, -0.16741153597831726, 0.12619498372077942, 0.12514415383338928, 0.07799778133630753, -0.11290162801742554, -0.0913979634642601, -0.17090748250484467, -0.022595159709453583, -0.16979387402534485, 0.19347812235355377, 0.14788444340229034, 0.12166010588407516, 0.11944513767957687, -0.037798624485731125, 0.08993495255708694, 0.004062458872795105, 0.015142656862735748, 0.1224183440208435, -0.11029602587223053, -0.12422722578048706, -0.15988069772720337, -0.14164350926876068, 0.041622377932071686, -0.13125991821289062, 0.00025842079776339233, 0.1026889979839325, 0.16475772857666016, 0.1361178159713745, -0.07679297775030136, -0.061163004487752914, 0.03979302942752838, -0.13325628638267517, 0.11254377663135529, -0.14890427887439728, 0.04420415684580803, 0.16262421011924744, 0.056243687868118286, 0.003986125811934471, -0.04540996253490448, 0.09896090626716614, -0.0773451179265976, -0.120642751455307, -0.10893061012029648, -0.08341225981712341, 0.1694370061159134, 0.12754996120929718, -0.2027280032634735, -0.06604079902172089, 0.021565066650509834, -0.12024138867855072, 0.10256558656692505, -0.1681017279624939, -0.11073437333106995, 0.13626216351985931, -0.14908327162265778, 0.12935461103916168, 0.06217537447810173, 0.13402163982391357, -0.10778462886810303, -0.10519307106733322, -0.03565707802772522, 0.0705672949552536, -0.14515772461891174, -0.15523116290569305, 0.1694977581501007, -0.007793588098138571, -0.16995200514793396, 0.005792947020381689, -0.03340043127536774, -0.11397258937358856, -0.024722620844841003, 0.02103755809366703], [0.09657112509012222, -0.08194855600595474, -0.13273996114730835, 0.11368095129728317, -0.0656290352344513, 0.04035397246479988, 0.1304771602153778, -0.25644028186798096, 0.012860076501965523, -0.10306479036808014, -0.07878884673118591, 0.03434935212135315, -0.0613606758415699, -0.005199582781642675, -0.03102731704711914, -0.17674103379249573, -0.1309162676334381, -0.041387949138879776, -0.16200745105743408, -0.17303232848644257, -0.052247919142246246, -0.04971510171890259, -0.03970631957054138, 0.11803048849105835, 0.10313636064529419, -0.19719523191452026, 0.018154582008719444, 0.12801450490951538, 0.10705454647541046, -0.07496118545532227, -0.04735119640827179, 0.11520899832248688, 0.03710687905550003, 0.08628033101558685, 0.1371246576309204, -0.13682182133197784, 0.18668881058692932, 0.0381370447576046, -0.035162076354026794, -0.09018763899803162, -0.1652027815580368, 0.01871459186077118, 0.010064123198390007, -0.0359325110912323, -0.14399997889995575, -0.006989482790231705, 0.19190025329589844, -0.26877880096435547, 0.13936592638492584, -0.1887095719575882, -0.06672792881727219, -0.08990951627492905, 0.13792267441749573, -0.17253166437149048, 0.123310387134552, -0.1484738141298294, 0.09727261960506439, -0.056007348001003265, -0.04498603940010071, -0.018310202285647392, 0.12026774883270264, 0.07799038290977478, 0.07411181926727295, 0.027495574206113815, 0.15886270999908447, -0.14042413234710693, -0.000792189734056592, 0.15335214138031006, -0.06798625737428665, -0.024639785289764404, 0.1593177765607834, 0.06768381595611572, -0.1258702427148819, 0.11657008528709412, 0.04984280839562416, 0.04659253731369972, -0.03413452208042145, -0.15676908195018768, 0.17016386985778809, 0.02079654671251774, 0.1319011002779007, -0.10694964230060577, -0.10578008741140366, -0.019074872136116028, -0.11434812843799591, 0.2025107741355896, -0.10269828885793686, 0.08400491625070572, -0.240661159157753, -0.07834010571241379, 0.027694109827280045, -0.02809235453605652, -0.030719086527824402, 0.07820969820022583, 0.04053156077861786, 0.09973612427711487, 0.14797072112560272, -0.00047705412725917995, 0.04966355860233307, -0.1583646982908249, -0.09923452138900757, 0.03823449835181236, 0.06748942285776138, -0.09765022993087769, 0.0106149110943079, -0.09390263259410858, -0.13119617104530334, 0.11718382686376572, -0.11027635633945465, 0.03673294931650162, -0.1865885853767395, 0.11073369532823563, 0.23896192014217377, -0.28570935130119324, 0.46309757232666016, -0.024967633187770844, 0.034261658787727356, -0.10692314058542252, 0.16922035813331604, 0.07032981514930725, 0.020459622144699097, 0.004250768572092056, -0.10052761435508728, -0.028397370129823685, 0.11004036664962769, -0.03203725814819336, 0.15670639276504517, -0.08202792704105377], [-0.06227613240480423, 0.16423256695270538, -0.00882774405181408, 0.15238448977470398, 0.09091047197580338, -0.06493299454450607, 0.17957328259944916, -0.038763146847486496, 0.06827881187200546, -0.10439247637987137, -0.0734526664018631, 0.10585442185401917, -0.07449804246425629, -0.00732413912191987, 0.05792340636253357, -0.01713370531797409, 0.07161153107881546, -0.1289132833480835, -0.1724116951227188, -0.011958152055740356, 0.13375025987625122, 0.06791830062866211, 0.027009010314941406, 0.08157983422279358, 0.0806659460067749, 0.14478729665279388, -0.014435277320444584, -0.1313456892967224, -0.17622898519039154, 0.18378764390945435, 0.16187666356563568, 0.028925742954015732, 0.10760466009378433, -0.17876115441322327, -0.0205087810754776, 0.0034718718379735947, -0.11504989117383957, 0.00662936782464385, -0.14680910110473633, -0.12322918325662613, 0.14042900502681732, -0.12965096533298492, 0.13029812276363373, -0.1250375509262085, -0.013406256213784218, 0.09242215007543564, 0.1375076174736023, -0.023852499201893806, 0.17245781421661377, -0.10909561067819595, -0.02581533044576645, -0.1129612997174263, 0.17099809646606445, 0.08698767423629761, -0.1295313686132431, -0.07548310607671738, -0.0768621489405632, 0.05905218422412872, -0.1442006528377533, -0.1685095727443695, -0.0069607943296432495, -0.039570219814777374, 0.12925514578819275, 0.10798966884613037, -0.017703622579574585, 0.027604760602116585, -0.004593325313180685, 0.2053922861814499, 0.009445032104849815, 0.03734123334288597, -0.1286575049161911, 0.11684438586235046, 0.05557699874043465, 0.016514752060174942, -0.22132080793380737, 0.14432522654533386, 0.015031599439680576, 0.160437673330307, -0.19987313449382782, 0.1353728473186493, -0.08694157749414444, 0.12887004017829895, 0.17558734118938446, -0.14972880482673645, 0.03900616988539696, 0.10552136600017548, 0.12938076257705688, 0.06438542902469635, -0.08514143526554108, -0.13720537722110748, 0.17330405116081238, 0.16310590505599976, -0.0023573487997055054, 0.16570763289928436, -0.06754317879676819, 0.13700836896896362, 0.12157289683818817, -0.1437363177537918, -0.042188793420791626, 0.03719636797904968, -0.034986525774002075, -0.13266104459762573, 0.03289194032549858, 0.16643650829792023, -0.018402589485049248, 0.24415726959705353, -0.017998412251472473, -0.1340750902891159, 0.1407022327184677, 0.12826043367385864, 0.06936555355787277, 0.0653846338391304, -0.02098984830081463, 0.013841225765645504, -0.08600832521915436, -0.04114691913127899, 0.1649421751499176, 0.17523664236068726, -0.1634308099746704, 0.06007098779082298, 0.09541353583335876, -0.1141515001654625, -0.16081532835960388, -0.14315266907215118, 0.0991804301738739, 0.16454043984413147, -0.18154025077819824, -0.04567050188779831], [-0.06174350157380104, -0.0029793495777994394, 0.0035506372805684805, 0.18884238600730896, 0.035225655883550644, -0.09658720344305038, -0.09205245226621628, 0.11387288570404053, 0.10168244689702988, 0.07942237704992294, -0.15242238342761993, 0.021936684846878052, -0.037424877285957336, -0.024539072066545486, -0.15853258967399597, 0.15881197154521942, 0.12388470768928528, 0.10186717659235, -0.07774180918931961, 0.09821751713752747, 0.12247546017169952, 0.09950694441795349, -0.11763636022806168, -0.07918689399957657, -0.10154082626104355, 0.15769635140895844, -0.03975847363471985, 0.11421579122543335, 0.00927777774631977, 0.11304143816232681, 0.059384044259786606, -0.10663339495658875, 0.05924268066883087, -0.17586582899093628, 0.024820983409881592, 0.14014039933681488, 0.06682176887989044, 0.16348296403884888, -0.09366132318973541, -0.1527082920074463, -0.19663411378860474, 0.0648520439863205, -0.05658506602048874, 0.10550031065940857, 0.11795912683010101, 0.07735423743724823, -0.1511363536119461, 0.13634538650512695, 0.03914138674736023, 0.007687839679419994, -0.034003790467977524, -0.06875191628932953, 0.05656750500202179, -0.09819652140140533, -0.08317328989505768, 0.15687409043312073, -0.022505497559905052, -0.043964773416519165, -0.14983735978603363, 0.027102548629045486, 0.05621424317359924, -0.12972794473171234, 0.06451880931854248, 0.19242732226848602, 0.06323926150798798, 0.12593798339366913, -0.08049868792295456, -0.04465238004922867, -0.06037668138742447, 0.003048714715987444, -0.1475384384393692, 0.06674578785896301, 0.12245522439479828, 0.026919320225715637, 0.026007656008005142, -0.15826213359832764, 0.07781504839658737, -0.09974303841590881, 0.14248953759670258, -0.15436741709709167, 0.16973604261875153, -0.049786388874053955, -0.17488506436347961, -0.15899018943309784, -0.10701465606689453, 0.1630001962184906, 0.17147856950759888, 0.057096511125564575, 0.009908954612910748, -0.1332644820213318, -0.15281841158866882, -0.09009893238544464, -0.05207419395446777, -0.11945787072181702, -0.1758442372083664, 0.13265007734298706, -0.13684305548667908, -0.13136081397533417, -0.07710670679807663, 0.03627276420593262, -0.06493479013442993, -0.14635992050170898, 0.03315788507461548, 0.1026252806186676, -0.12936478853225708, -0.03845176473259926, -0.08727011829614639, 0.06474755704402924, 0.019944749772548676, -0.11878391355276108, 0.06396011263132095, -0.144213005900383, -0.029064588248729706, 0.13812655210494995, -0.11754640191793442, 0.048682745546102524, 0.06965209543704987, 0.0896250382065773, 0.04560810327529907, 0.06522949039936066, -0.03998580202460289, 0.09731816500425339, -0.024740641936659813, -0.18464790284633636, -0.07551277428865433, 0.016231685876846313, 0.002781362272799015, -0.06549694389104843], [0.14654019474983215, 0.000931696267798543, -0.0018163963686674833, -0.16317519545555115, 0.07702614367008209, 0.03516019135713577, 0.2064296454191208, -0.01036626286804676, 0.18087056279182434, -0.19179534912109375, -0.08655278384685516, -0.09565416723489761, 0.08245877921581268, 0.03254207223653793, 0.14077064394950867, 0.1409737914800644, 0.018296198919415474, 0.20019160211086273, -0.1633937954902649, -0.12001556158065796, 0.04999426379799843, -0.03238630294799805, -0.030386269092559814, -0.041415274143218994, -0.09104244410991669, 0.05808275565505028, 0.1282283067703247, -0.10141443461179733, -0.17912301421165466, -0.06033037230372429, 0.041799772530794144, 0.03968191519379616, -0.03009629063308239, -0.06507094949483871, -0.1626216322183609, -0.051699016243219376, -0.17647680640220642, -0.19167909026145935, 0.14741265773773193, 0.18008051812648773, -0.10173072665929794, -0.15150174498558044, -0.11060440540313721, 0.012645676732063293, -0.29160192608833313, 0.022132253274321556, -0.12471289932727814, -0.20584076642990112, 0.03603796660900116, -0.025790339335799217, 0.1287258267402649, -0.11024049669504166, -0.07044412195682526, -0.13644525408744812, -0.019997872412204742, -0.06375623494386673, 0.10769130289554596, -0.05081205070018768, -0.14290839433670044, -0.16706684231758118, -0.0048044174909591675, 0.16322088241577148, -0.05256863683462143, 0.14715485274791718, -0.040181756019592285, 0.13343718647956848, -0.0699799433350563, -0.1550426334142685, 0.3101244568824768, -0.10573749244213104, -0.044535938650369644, -0.09987543523311615, -0.020520586520433426, -0.04522044211626053, -0.1097780391573906, -0.024314483627676964, -0.05291099473834038, 0.06932240724563599, 0.15895889699459076, 0.08361267298460007, -0.05935971438884735, -0.021051108837127686, -0.12852303683757782, -0.0449584424495697, 0.08490777015686035, 0.2247847616672516, -0.043446362018585205, 0.1004161611199379, -0.12377110868692398, -0.026903286576271057, 0.11556467413902283, -0.02548167109489441, -0.16333650052547455, 0.1372922956943512, -0.14783573150634766, -0.16593031585216522, -0.14763200283050537, -0.017817428335547447, -0.029942110180854797, -0.10913602262735367, -0.14136551320552826, 0.08701587468385696, -0.02102348580956459, -0.11167338490486145, -0.1688765287399292, -0.067760169506073, 0.08202958106994629, -0.14911240339279175, 0.1499442458152771, -0.0021076961420476437, 0.15057577192783356, -0.12595723569393158, 0.3593975007534027, -0.08623073250055313, 0.26528409123420715, -0.06290052086114883, -0.05348709225654602, 0.02126627415418625, 0.008826777338981628, 0.01762779802083969, -0.024113677442073822, -0.08576650172472, -0.012790900655090809, 0.04275603964924812, -0.02365747094154358, 0.14637455344200134, 0.062102124094963074, 0.0835551768541336], [-0.13136965036392212, 0.13791599869728088, 0.1707242876291275, 0.10362721979618073, 0.16688790917396545, 0.13198800384998322, 0.055819958448410034, -0.020167147740721703, 0.06780403852462769, 0.06006903201341629, -0.13119708001613617, -0.03915685415267944, -0.07938502728939056, -0.03217437490820885, 0.15937620401382446, 0.12770703434944153, -0.1224602535367012, 0.06467115134000778, 0.15568816661834717, 0.11565440893173218, 0.01164720207452774, -0.018702492117881775, 0.09991765022277832, -0.02648383378982544, -0.10108939558267593, -0.032136715948581696, -0.1486218124628067, -0.15157780051231384, 0.055430132895708084, -0.11860992014408112, -0.028718288987874985, 0.09338295459747314, 0.10541240125894547, -0.17238512635231018, -0.16120792925357819, 0.014095431193709373, 0.030555136501789093, -0.12462818622589111, -0.10484988987445831, 0.0010753553360700607, 0.20366480946540833, -0.08503759652376175, 0.26872944831848145, -0.16172848641872406, -0.048685602843761444, 0.1584857553243637, 0.03148334473371506, 0.24239060282707214, 0.1918586939573288, 0.014097516424953938, 0.03299512714147568, -0.11683013290166855, 0.1658060997724533, 0.06601183116436005, -0.10053405910730362, -0.13950669765472412, -0.1846977174282074, -0.06606891751289368, 0.15463361144065857, -0.07633837312459946, 0.08550247550010681, -0.18391479551792145, 0.08579280972480774, 0.02088857814669609, 0.08613961935043335, 0.03461511805653572, -0.10937236249446869, 0.03906247392296791, 0.02345173805952072, -0.11104609817266464, -0.07086820900440216, 0.16909056901931763, -0.12121547013521194, 0.09101897478103638, -0.09047060459852219, -0.029881015419960022, -0.050995923578739166, -0.14648836851119995, -0.09488336741924286, 0.10405268520116806, 0.01761575974524021, 0.15418961644172668, 0.017508195713162422, 0.014154285192489624, 0.08354459702968597, 0.04892502352595329, 0.01614341139793396, 0.12219610810279846, -0.06518600881099701, -0.015020132064819336, -0.06425517052412033, 0.03186987340450287, -0.15890656411647797, -0.08050944656133652, -0.06407273560762405, -0.012979209423065186, 0.003829733468592167, 0.1795184314250946, -0.10140027850866318, 0.11281690001487732, -0.09618087857961655, 0.13534843921661377, -0.035597749054431915, 0.014992241747677326, 0.004579876083880663, -0.07586102932691574, -0.09272249788045883, -0.031146982684731483, 0.10874660313129425, 0.1432957649230957, 0.17672358453273773, 0.006577987689524889, -0.09544461220502853, 0.09211680293083191, 0.06962762773036957, -0.05818048119544983, 0.15146049857139587, -0.17751798033714294, -0.10380943864583969, -0.033193543553352356, 0.16925722360610962, -0.17892831563949585, -0.014845377765595913, -0.03752095624804497, -0.0916290134191513, 0.025902122259140015, 0.01367843709886074, -0.07755660265684128], [0.07362091541290283, -0.00323273753747344, -0.055028434842824936, 0.033324453979730606, 0.0524631105363369, 0.10192082822322845, -0.13104544579982758, -0.16219449043273926, -0.03814254328608513, 0.06132940202951431, -0.12158273905515671, -0.06502965092658997, -0.12643936276435852, 0.1413605660200119, 0.10648393630981445, 0.07605874538421631, 0.11407134681940079, 0.11244000494480133, -0.01992332935333252, -0.1299957036972046, -0.021504618227481842, -0.13067612051963806, 0.14975300431251526, -0.1465047150850296, -0.06813900172710419, -0.12622366845607758, -0.1732572317123413, -0.004524931311607361, -0.10125310719013214, -0.12108224630355835, 0.012731961905956268, -0.08407910168170929, -0.05086046829819679, 0.09593179821968079, -0.07411765307188034, -0.07216542959213257, 0.145019993185997, 0.007324308156967163, 0.011712968349456787, -0.05978501960635185, 0.08634357899427414, 0.04048334062099457, -0.0676925778388977, 0.06990653276443481, 0.13952702283859253, -0.08205834776163101, 0.15107549726963043, -0.15824483335018158, 0.12069642543792725, 0.10580282658338547, -0.0852930024266243, 0.1504334658384323, 0.0023887099232524633, -0.053911738097667694, 0.05959928408265114, -0.017324745655059814, -0.008777073584496975, -0.14111340045928955, 0.07291874289512634, 0.014062603935599327, -0.09872439503669739, -0.00979612860828638, 0.1697145700454712, -0.03240467607975006, 0.12480488419532776, 0.09603346139192581, -0.044087447226047516, -0.13967488706111908, -0.15140514075756073, -0.003958144225180149, 0.08738257735967636, 0.02006584405899048, -0.13649015128612518, -0.1863315850496292, -0.1471058428287506, -0.05881541594862938, 0.005866081919521093, -0.16909536719322205, -0.12052100896835327, -0.022268671542406082, 0.11509447544813156, 0.1585865616798401, 0.13250340521335602, -0.10449513792991638, 0.048447877168655396, -0.0006565898074768484, 0.0402015745639801, 0.020127082243561745, -0.16857071220874786, 0.057429417967796326, 0.09564031660556793, 0.1216936707496643, -0.1539897471666336, -0.1173243448138237, 0.04162241518497467, -0.05791309475898743, 0.028445115312933922, -0.001070624217391014, -0.06402485817670822, 0.06919322907924652, 0.03615947067737579, 0.11405476182699203, 0.01604611612856388, -0.03424287959933281, -0.0878269299864769, 0.08223889023065567, -0.1217382550239563, -0.007224821951240301, -0.13809563219547272, -0.14844468235969543, 0.13376913964748383, 0.01975671947002411, -0.07899849861860275, -0.031397707760334015, 0.13191936910152435, -0.01572626456618309, -0.16184863448143005, 0.08508771657943726, -0.1456349790096283, 0.03943594917654991, -0.14775130152702332, 0.1393306851387024, 0.06031395122408867, 0.12209770828485489, -0.08309119194746017, -0.06353256851434708, 0.05561557412147522, 0.01905280351638794], [-0.10265614837408066, 0.056429386138916016, 0.0244064312428236, 0.14716243743896484, 0.1497587263584137, -0.09800850600004196, 0.10757714509963989, 0.103470079600811, 0.008113236166536808, 0.07089803367853165, 0.1929866224527359, -0.053027547895908356, -0.1219840869307518, 0.11433687806129456, -0.055238015949726105, 0.03733205050230026, 0.16580069065093994, 0.12102535367012024, -0.19728174805641174, 0.10352373123168945, -0.04097490385174751, 0.17050877213478088, 0.04982772469520569, 0.14216351509094238, -0.07542445510625839, 0.08754485100507736, 0.0054865144193172455, -0.08226379752159119, -0.11315492540597916, 0.13417284190654755, -0.11093911528587341, -0.10158957540988922, 0.15548743307590485, 0.033776961266994476, -0.05706655979156494, -0.16398480534553528, -0.09930354356765747, 0.062291789799928665, 0.16223764419555664, -0.039163582026958466, 0.1744055449962616, 0.13637304306030273, 0.05967267230153084, -0.032078713178634644, 0.0842144563794136, -0.07356669008731842, 0.0464395135641098, -0.09834515303373337, 0.03615325689315796, -0.18056927621364594, 0.3532504737377167, 0.07270129770040512, 0.05294498801231384, -0.15094280242919922, -0.04326698184013367, -0.16232481598854065, -0.03553334251046181, -0.13081121444702148, -0.09011223912239075, -0.05378139019012451, 0.026865452527999878, -0.0027261909563094378, -0.0037097036838531494, -0.18862318992614746, -0.054795630276203156, 0.0764852911233902, -0.013664267025887966, 0.11585212498903275, 0.26160675287246704, -0.13883814215660095, 0.1667446494102478, -0.06824587285518646, -0.010406749323010445, 0.04441971704363823, 0.10512811690568924, -0.02521301805973053, -0.13300974667072296, -0.03246058523654938, -0.006392691750079393, 0.08376327902078629, -0.09959964454174042, -0.09451064467430115, 0.12802134454250336, -0.04790620505809784, -0.039256587624549866, -0.009281574748456478, 0.10847023129463196, 0.07713999599218369, 0.09892573952674866, -0.05582864582538605, -0.08140275627374649, -0.15086928009986877, 0.16594764590263367, 0.19129638373851776, -0.1231226772069931, -0.024362117052078247, 0.1439269632101059, 0.002572367200627923, 0.030131161212921143, -0.09292330592870712, 0.17015212774276733, -0.07448793202638626, -0.0409286767244339, -0.043619558215141296, 0.10797347873449326, 0.26405003666877747, -0.09112615883350372, -0.15849848091602325, -0.07493800669908524, 0.08990386128425598, 0.09723623842000961, -0.03653445467352867, -0.10825903713703156, -0.012483788654208183, -0.04930490255355835, 0.045922886580228806, -0.12243891507387161, -0.2007245421409607, -0.10517358034849167, -0.07477494329214096, 0.16751986742019653, 0.15372557938098907, 0.029496071860194206, -0.17202463746070862, -0.1223582923412323, 0.1339460015296936, -0.00479990104213357, 0.1744684875011444], [-0.09014392644166946, 0.07769474387168884, -0.07299415022134781, -0.11109113693237305, 0.2473611831665039, -0.0643789991736412, -0.004709698259830475, -0.04738004505634308, 0.10574602335691452, -0.00946778617799282, -0.08772151172161102, 0.020054519176483154, -0.051282066851854324, -0.0676421970129013, 0.09532684087753296, 0.058689843863248825, 0.2097620666027069, 0.14011217653751373, -0.13580062985420227, -0.06983046978712082, 0.1475468873977661, -0.08185923099517822, -0.14898787438869476, 0.13600879907608032, 0.04536639153957367, -0.009106870740652084, 0.05789828300476074, 0.01316019892692566, -0.07737590372562408, -0.03139166906476021, 0.11493374407291412, -0.1825752705335617, -0.13980820775032043, 0.009807574562728405, -0.04958935081958771, -0.10079070925712585, 0.11150886863470078, -0.02582196518778801, -0.016970515251159668, 0.16050288081169128, 0.0038113908376544714, -0.11344467103481293, 0.08611186593770981, 0.028860241174697876, 0.08505341410636902, 0.12225190550088882, 0.11683979630470276, 0.14572803676128387, 0.10632631927728653, 0.0336344949901104, 0.24609734117984772, -0.0820864662528038, 0.0828629806637764, 0.15151309967041016, 0.16673283278942108, 0.034875959157943726, 0.15536324679851532, -0.16351988911628723, -0.016962990164756775, 0.013437640853226185, 0.1240597665309906, 0.1058824211359024, -0.04959876835346222, -0.1609141230583191, 0.1298818290233612, -0.14577524363994598, -0.1571170836687088, 0.10118593275547028, 0.08934208005666733, -0.020728297531604767, -0.14054985344409943, -0.14383521676063538, 0.10994447022676468, 0.11628139019012451, -0.07635527849197388, 0.11734924465417862, 0.18762730062007904, 0.09739789366722107, 0.14339150488376617, -0.11651405692100525, 0.0681127980351448, -0.05937311798334122, 0.10387858003377914, -0.08733797818422318, -0.08080372959375381, -0.12335377186536789, -0.17151741683483124, 0.062098439782857895, -0.09270892292261124, -0.14234362542629242, 0.006632584147155285, 0.05945831537246704, -0.1603507399559021, -0.08137694746255875, 0.14668706059455872, -0.016172990202903748, -0.13603617250919342, 0.08887424319982529, -0.12125077843666077, -0.019636213779449463, 0.10273749381303787, -0.1480613797903061, 0.10795552283525467, 0.06562657654285431, 0.03546273335814476, 0.02316317893564701, -0.021940872073173523, 0.07821477204561234, -0.08876226842403412, -0.01352207362651825, -0.05468020215630531, 0.036035969853401184, 0.14813214540481567, -0.12156034260988235, 0.09463483095169067, 0.04099477082490921, 0.08635681867599487, -0.09102662652730942, 0.039258524775505066, -0.03778062388300896, 0.0768497884273529, -0.1260593682527542, -0.024404209107160568, -0.07280536741018295, -0.15326495468616486, 0.05017608404159546, 0.08423962444067001, 0.09873002767562866], [-0.022531166672706604, -0.1852244734764099, 0.024469463154673576, 0.18104612827301025, -0.11368916183710098, -0.15271535515785217, -0.0002556527906563133, -0.10160248726606369, 0.15289103984832764, -0.17137481272220612, -0.02483164705336094, -0.11325135082006454, 0.04364606365561485, -0.10779590159654617, 0.08327335119247437, 0.08025816082954407, 0.004576950334012508, 0.07618973404169083, -0.0737888440489769, 0.10573685169219971, 0.09120386093854904, -0.11564800143241882, -0.1341741979122162, -0.07076498121023178, -0.09403090178966522, 0.12233254313468933, -0.14193399250507355, 0.14204466342926025, -0.10683267563581467, 0.11853615939617157, 0.04272865504026413, 0.06729976087808609, -0.07160385698080063, 0.06441836804151535, -0.03151610493659973, -0.16673383116722107, -0.041651755571365356, -0.07252781838178635, 0.09696260094642639, -0.07496365159749985, -0.02538084238767624, 0.05573597550392151, 0.09701074659824371, 0.11638239026069641, -0.1649213582277298, -0.011485868133604527, 0.12370949238538742, 0.06902724504470825, -0.1293732225894928, 0.0428936704993248, -0.13192546367645264, 0.12065291404724121, -0.059266798198223114, -0.12701772153377533, 0.05268939957022667, 0.13115644454956055, -0.12997281551361084, -0.15641525387763977, 0.1348116397857666, 0.1287897229194641, -0.13144519925117493, 0.12415017187595367, -0.09477116167545319, 0.14756371080875397, 0.017684102058410645, 0.046835221350193024, -0.12264199554920197, 0.1745743602514267, -0.08896948397159576, 0.12013612687587738, -0.1279708594083786, 0.0814010500907898, -0.14044834673404694, -0.03530813381075859, -0.043196793645620346, 0.09836726635694504, 0.041338592767715454, -0.06411325931549072, -0.1578608900308609, 0.07662365585565567, -0.08250484615564346, -0.1659896969795227, 0.12665604054927826, 0.07182702422142029, -0.03270270302891731, 0.017049318179488182, 0.1566360592842102, 0.06855505704879761, -0.027474457398056984, 0.1298525631427765, -0.08168862015008926, -0.13374829292297363, -0.08668430894613266, 0.19280259311199188, 0.08981961011886597, -0.11358940601348877, -0.0262561347335577, -0.18091173470020294, -0.013329312205314636, 0.05351169407367706, -0.10265715420246124, -0.04141630977392197, 0.04878133535385132, -0.0931924432516098, -0.08669991046190262, 0.15586857497692108, -0.03130266070365906, 0.1239750012755394, -0.01604655385017395, -0.17229413986206055, 0.06144559010863304, 0.06935591995716095, -0.009925620630383492, 0.027833323925733566, 0.03215146064758301, 0.043127983808517456, 0.07566556334495544, -0.06338265538215637, -0.11580781638622284, 0.1176992729306221, 0.09803938865661621, -0.009395123459398746, -0.04722972214221954, -0.059688225388526917, 0.06324243545532227, 0.07812261581420898, 0.005759967491030693, -0.053788840770721436], [-0.02622368186712265, -0.053424492478370667, -0.09058236330747604, 0.13689790666103363, -0.14604999125003815, 0.06114421412348747, 0.0425276942551136, 0.05781692638993263, 0.06651780009269714, 0.1760593205690384, -0.030648233368992805, 0.13683849573135376, -0.03773554041981697, 0.1293441653251648, 0.013921618461608887, 0.06530068069696426, 0.12064414471387863, 0.11487143486738205, 0.09424901753664017, -0.06428135931491852, -0.0251977127045393, -0.15291427075862885, -0.14794568717479706, 0.01170283555984497, -0.15413448214530945, 0.049628354609012604, -0.014706121757626534, 0.10946431756019592, 0.1257520467042923, 0.017778513953089714, 0.1234227865934372, 0.033029355108737946, -0.08412490040063858, -0.15014326572418213, 0.14809679985046387, -0.15190261602401733, 0.021802768111228943, 0.12404803931713104, 0.118379145860672, 0.22438789904117584, 0.19595350325107574, -0.13814294338226318, 0.1043146625161171, 0.10003113746643066, -0.06201399862766266, -0.18099567294120789, 0.0623081736266613, 0.03417615592479706, -0.13514626026153564, -0.026702269911766052, 0.23864740133285522, -0.03273278474807739, 0.0713447630405426, 0.08642488718032837, -0.09706708788871765, -0.1093784049153328, -0.077585868537426, 0.0882902443408966, 0.08697199821472168, 0.0419016070663929, -0.046442896127700806, 0.04582420364022255, -0.15458591282367706, -0.06892606616020203, 0.056914567947387695, 0.07466792315244675, 0.10523847490549088, -0.013934805989265442, -0.08020895719528198, -0.026954934000968933, -0.06724337488412857, -0.016077831387519836, 0.4257335960865021, 0.0323524996638298, -0.08358274400234222, 0.15113750100135803, 0.20219440758228302, -0.09815151244401932, 0.02595045417547226, 0.05100172385573387, 0.03623608872294426, -0.1632843166589737, 0.28737226128578186, 0.11419081687927246, 0.10353463143110275, 0.03821113333106041, -0.16147825121879578, -0.1441769152879715, 0.26423975825309753, 0.05455183982849121, -0.10980086773633957, -0.17487195134162903, -0.1666918396949768, -0.06157833710312843, -0.06859660893678665, 0.03722405433654785, 0.15996339917182922, -0.03188606724143028, -0.09696117788553238, -0.1383322924375534, 0.012622022069990635, 0.12206434458494186, -0.1455935835838318, 0.240446999669075, 0.004022052977234125, 0.06251132488250732, -0.13455332815647125, -0.04420960694551468, 0.07157223671674728, -0.051696501672267914, -0.1432991623878479, 0.16203629970550537, -0.14649789035320282, 0.18791481852531433, -0.01108182780444622, 0.04797323793172836, -0.09980034083127975, 0.006989408750087023, -0.022533223032951355, -0.22605372965335846, -0.11764271557331085, -0.0076237935572862625, -0.15875375270843506, -0.10947868227958679, -0.09811652451753616, 0.026880547404289246, -0.17117828130722046, 0.07865314185619354], [0.10081806778907776, -0.1010967344045639, -0.050811972469091415, 0.009400569833815098, 0.23938584327697754, -0.07907511293888092, 0.02495216578245163, 0.11022573709487915, 0.10607423633337021, 0.010815572924911976, -0.0867212638258934, -0.13008376955986023, 0.18078306317329407, 0.04632236063480377, -0.09303054958581924, -0.07887674123048782, 0.154771625995636, 0.007407344877719879, 0.12478944659233093, -0.10861866921186447, 0.041046932339668274, 0.151571124792099, 0.005723044276237488, -0.07114064693450928, -0.14892897009849548, 0.08424580842256546, 0.11825815588235855, 0.09832024574279785, 0.12049727141857147, -0.06591854989528656, 0.1763644814491272, -0.14178325235843658, -0.018376987427473068, -0.24029619991779327, 0.07359591126441956, -0.1548205465078354, 0.022769616916775703, -0.057798877358436584, -0.12776917219161987, 0.04025774076581001, 0.1615249514579773, 0.16968870162963867, 0.04240023344755173, 0.09378951787948608, 0.16644851863384247, 0.09998788684606552, 0.00935275573283434, -0.10318735986948013, -0.07034184038639069, 0.009375355206429958, 0.23855021595954895, 0.06176472455263138, -0.11402736604213715, -0.09380952268838882, -0.029345465824007988, 0.08664917945861816, 0.07213225960731506, 0.03605298697948456, -0.1256810873746872, -0.06289993971586227, 0.018933817744255066, 0.03331037610769272, 0.0879414975643158, -0.1391967386007309, 0.1582951843738556, -0.06258875876665115, 0.10740382224321365, 0.03822875767946243, -0.06633496284484863, 0.004193886183202267, -0.04673149436712265, 0.008504688739776611, 0.1820463240146637, -0.07390522211790085, -0.1160038486123085, 0.014846374280750751, 0.07050676643848419, 0.010854572057723999, -0.13799045979976654, 0.06517742574214935, 0.011078454554080963, 0.1032792329788208, 0.22611425817012787, 0.06831103563308716, 0.01128295436501503, -0.1457182914018631, 0.16108348965644836, -0.021298974752426147, 0.21206220984458923, 0.11414796113967896, -0.12368479371070862, 0.01845964789390564, -0.08194970339536667, 0.17255742847919464, 0.12890788912773132, -0.05341555178165436, -0.005951187573373318, 0.1188252717256546, -0.1478520780801773, 0.001448020339012146, 0.199310764670372, 0.10427993535995483, -0.07036173343658447, -0.08856178820133209, 0.017934761941432953, 0.0809822529554367, -0.05315934866666794, -0.05376620590686798, 0.2000902146100998, -0.08680246025323868, -0.04928305000066757, 0.009964562021195889, 0.05246184393763542, 0.039147570729255676, 0.03217906132340431, 0.1700238436460495, -0.02179001271724701, -0.06169472634792328, 0.06414014101028442, 0.029907753691077232, 0.028944240882992744, 0.08890516310930252, 0.021959135308861732, 0.00763187138363719, 0.12489944696426392, 0.06996738910675049, 0.11567884683609009, 0.04066726937890053], [-0.02557995356619358, 0.0030137854628264904, 0.04800742492079735, 0.10329222679138184, -0.18711064755916595, -0.1802157759666443, 0.027703162282705307, 0.13216297328472137, -0.07328769564628601, -0.07138841599225998, 0.08350352942943573, 0.15270018577575684, 0.09733983129262924, -0.03169384226202965, 0.03035770356655121, 0.15350186824798584, -0.030290713533759117, 0.20201314985752106, 0.10449066758155823, -0.13597950339317322, 0.126429945230484, -0.008806198835372925, 0.12659761309623718, 0.007097318768501282, -0.09730633348226547, -0.021915044635534286, 0.009031685069203377, -0.0511443167924881, 0.13307447731494904, 0.10571558028459549, 0.06499762833118439, 0.05353923887014389, 0.033755235373973846, 0.11020045727491379, -0.039244115352630615, 0.15190057456493378, 0.1343574970960617, 0.19409450888633728, -0.09776372462511063, -0.060046736150979996, -0.09854871779680252, -0.09666402637958527, 0.10629043728113174, 0.1052359938621521, -0.09346959739923477, 0.0016816714778542519, 0.011253423057496548, 0.05775383859872818, -0.09753408282995224, 0.040066469460725784, -0.05513019487261772, -0.06456023454666138, 0.12747851014137268, -0.01881439983844757, -0.05980744957923889, -0.17650006711483002, 0.02075478993356228, -0.08270897716283798, -0.13348697125911713, -0.07661271840333939, -0.16749049723148346, -0.06853276491165161, -0.10381928086280823, 0.23263677954673767, -0.12674173712730408, -0.13103826344013214, -0.12793812155723572, 0.1757863461971283, -0.08098825067281723, 0.006000211928039789, -0.11263492703437805, 0.0028844624757766724, -0.16697943210601807, -0.0139851626008749, -0.1431998461484909, 0.12791061401367188, 0.0458354689180851, 0.06909620761871338, -0.13375017046928406, -0.13586637377738953, 0.035622481256723404, 0.05803994834423065, -0.006747968029230833, -0.14502748847007751, -0.021318593993782997, 0.03751687332987785, -0.11481261998414993, -0.16212710738182068, -0.06284364312887192, 0.01899018883705139, -0.025175295770168304, -0.1691761612892151, 0.12982633709907532, -0.06807966530323029, -0.0262153297662735, -0.1588502824306488, -0.03659997507929802, -0.13584168255329132, -0.007568791508674622, 0.030787169933319092, -0.02474644035100937, -0.163272887468338, -0.04933236539363861, 0.10558399558067322, -0.08768779784440994, -0.10448867082595825, -0.07148990035057068, 0.10750536620616913, 0.0342550128698349, -0.17098850011825562, 0.031255416572093964, -0.02403370477259159, -0.19483309984207153, 0.13137786090373993, -0.08609604835510254, -0.2334320992231369, -0.061174578964710236, 0.051945656538009644, 0.16642633080482483, 0.12740565836429596, -0.04427286610007286, -0.12442351877689362, -0.0344800129532814, -0.08668921142816544, 0.035632312297821045, -0.054274216294288635, 0.08910033106803894, -0.12099043279886246], [0.15928049385547638, -0.11888536065816879, 0.014157252386212349, -0.10548239201307297, -0.16771972179412842, -0.11879022419452667, -0.19330869615077972, -0.07459662109613419, 0.1317964494228363, 0.08301092684268951, -0.043486472219228745, 0.05577303469181061, 0.025507120415568352, -0.04923590272665024, 0.025781020522117615, -0.042953234165906906, 0.029138099402189255, 0.16988544166088104, -0.09349934011697769, 0.14697334170341492, 0.10409578680992126, -0.14430996775627136, 0.14025598764419556, -0.1546977162361145, 0.005881547927856445, 0.11954902857542038, -0.07375969737768173, -0.05229206383228302, -0.003327671904116869, -0.07027200609445572, -0.13343898952007294, -0.02282804809510708, -0.04598090797662735, 0.10311456769704819, -0.03879694640636444, 0.043037742376327515, -0.04807872325181961, -0.0054043615236878395, -0.044245436787605286, -0.0006295993225648999, -0.02272852323949337, -0.07489117234945297, -0.015411997213959694, -0.15403366088867188, 0.19535084068775177, -0.0789613202214241, -0.054732054471969604, 0.11637414991855621, -0.13001859188079834, 0.09399425238370895, -0.11939408630132675, -0.09082918614149094, 0.014202285557985306, -0.05851420760154724, 0.0710788369178772, -0.0023069381713867188, 0.03510114178061485, 0.1380973756313324, -0.06402219831943512, -0.08937186002731323, -0.17638014256954193, 0.10280133783817291, -0.07768892496824265, 0.17981012165546417, -0.12456457316875458, 0.20686234533786774, -0.08815038949251175, -0.21411879360675812, 0.06415225565433502, 0.06585719436407089, -0.10319866985082626, 0.05547274649143219, 0.13266541063785553, -0.035198356956243515, 0.16045215725898743, 0.19268518686294556, 0.05091578885912895, -0.09796012938022614, 0.12571510672569275, -0.08000680059194565, 0.033323634415864944, -0.158803328871727, 0.12990590929985046, 0.042595550417900085, -0.09050768613815308, -0.15787965059280396, -0.04739704728126526, 0.0969051793217659, 0.18949344754219055, -0.11040820926427841, -0.11509520560503006, 0.09445208311080933, -0.12940368056297302, -0.00827470701187849, -0.040255650877952576, -0.04164722561836243, 0.09641789644956589, -0.12180276215076447, -0.1606341153383255, -0.0333663672208786, -0.1071704849600792, -0.20005187392234802, 0.10559060424566269, 0.229727104306221, 0.14850281178951263, -0.01063100527971983, 0.02040541172027588, -0.14007051289081573, -0.006416341755539179, 0.11952037364244461, 0.12805835902690887, 0.1503010094165802, -0.17500334978103638, 0.009435503743588924, -0.3647577464580536, -0.050602853298187256, 0.12200167775154114, -0.187346950173378, -0.14381137490272522, -0.042931392788887024, -0.17246796190738678, 0.22174327075481415, 0.10079442709684372, 0.16163013875484467, 0.15135645866394043, -0.04944334924221039, -0.00048674538265913725, -0.0287763774394989], [0.006392503157258034, 0.16891802847385406, 0.02069530263543129, 0.15069767832756042, 0.2064124345779419, 0.03050839714705944, 0.048386119306087494, 0.19350916147232056, 0.23300974071025848, 0.1569727659225464, 0.11414903402328491, 0.12975609302520752, 0.12592078745365143, 0.014449449256062508, -0.009840980172157288, 0.21435491740703583, 0.018016736954450607, 0.07865991443395615, -0.07841511815786362, 0.06282268464565277, 0.05573979765176773, -0.061691634356975555, -0.049264565110206604, 0.11833718419075012, 0.0037131309509277344, 0.15953335165977478, 0.14967592060565948, -0.10596953332424164, -0.08812621235847473, 0.03329169377684593, 0.05116109177470207, -0.08351723849773407, 0.05802736431360245, 0.12166907638311386, 0.027680426836013794, -0.11151310801506042, 0.14271268248558044, -0.09172520786523819, 0.1617908775806427, 0.01626838743686676, 0.1943204402923584, -0.09217345714569092, -0.06699854135513306, -0.052642881870269775, 0.05814620852470398, -0.16267576813697815, -0.03339565545320511, 0.057115793228149414, 0.16318835318088531, -0.15208029747009277, 0.09466265887022018, 0.14120244979858398, -0.0014751972630620003, -0.11322899162769318, -0.1527111977338791, 0.07407510280609131, 0.13695450127124786, 0.0992175042629242, 0.017314940690994263, 0.04095675051212311, -0.012837052345275879, 0.10451819747686386, -0.1483067274093628, 0.036952272057533264, 0.03963156044483185, -0.0512668751180172, 0.1395893543958664, -0.16679051518440247, 0.0635254979133606, -0.08815576881170273, 0.06953026354312897, -0.10833580046892166, 0.13726399838924408, 0.03526796028017998, 0.1685550957918167, -0.1151481494307518, 0.044671546667814255, -0.03355094790458679, 0.14195989072322845, 0.0568494014441967, 0.06215531751513481, -0.019334331154823303, 0.13336440920829773, 0.05577950179576874, 0.02762823924422264, 0.10944601893424988, 0.11017802357673645, -0.015940191224217415, 0.17892900109291077, -0.16912439465522766, -0.13004998862743378, -0.12063094973564148, 0.004009723663330078, 0.08020272850990295, -0.06602311134338379, 0.17180678248405457, 0.15221638977527618, 0.02375163696706295, 0.08919534087181091, -0.003369957208633423, 0.18652114272117615, -0.0799974799156189, 0.05889897421002388, 0.030423862859606743, -0.09249928593635559, 0.032516323029994965, -0.005666032433509827, 0.15082095563411713, -0.008567186072468758, 0.0998392403125763, 0.17146894335746765, -0.10508620738983154, -0.0027967658825218678, -0.1350819170475006, 0.21821977198123932, -0.0760050043463707, 0.05216479301452637, 0.09871932864189148, 0.1648501455783844, -0.06288410723209381, 0.025854317471385002, 0.07302635908126831, 0.16259326040744781, 0.041904207319021225, -0.04612591862678528, 0.11891776323318481, -0.05320924520492554, 0.12695957720279694], [0.046290960162878036, -0.158289834856987, -0.12801441550254822, -0.0843261256814003, 0.15939685702323914, 0.12159453332424164, -0.171698197722435, -0.1916320025920868, -0.19740614295005798, -0.18672311305999756, 0.13728855550289154, 0.001659005880355835, 0.03484925627708435, 0.03103472664952278, 0.1767270267009735, -0.18201680481433868, 0.0700342133641243, 0.09822743386030197, -0.0015216132160276175, -0.05293166637420654, 0.06633731722831726, 0.005923420190811157, 0.09957858920097351, 0.15958896279335022, -0.09483594447374344, 0.042979542165994644, 0.07528294622898102, -0.043199747800827026, 0.00645194947719574, -0.12768042087554932, 0.12057460099458694, -0.05748213827610016, 0.07714720070362091, 0.04440242052078247, -0.028827205300331116, -0.1754121482372284, 0.015548442490398884, 0.03861156105995178, 0.07342201471328735, 0.09255494177341461, -0.0697903037071228, -0.15706732869148254, 0.017557622864842415, -0.13161984086036682, -0.13220523297786713, 0.07521720230579376, -0.0015652988804504275, 0.21054035425186157, -0.18407851457595825, -0.05338272452354431, 0.07928376644849777, -0.06280986219644547, -0.16667453944683075, 0.02788710594177246, -0.08092225342988968, 0.05550706386566162, -0.005040498450398445, -0.02203860878944397, 0.10270380973815918, 0.1286763697862625, -0.11311016976833344, -0.032145872712135315, -0.14529819786548615, -0.02865784987807274, 0.031228840351104736, -0.07495696097612381, -0.04542657360434532, -0.10500872880220413, 0.14437875151634216, 0.08698465675115585, 0.0981387048959732, -0.023442983627319336, 0.12406720221042633, -0.0751078799366951, -0.09164368361234665, 0.041673872619867325, 0.14710187911987305, -0.17304593324661255, -0.03277619555592537, -0.04598896950483322, 